<?php
/**
 * 数字索引数组
 * 声明方法有两种：
 * 1.使用array()函数
 * $arr = array("1"=>"空调", "2"=>"冰箱", "3"=>"洗衣机", "4"=>"电视机");
 * $arr = array("空调", "冰箱", "洗衣机", "电视机")
 * 
 * 2.数组元素赋值
 * $arr[1] = "";
 * $arr[2] = "";
 * 
 * 关联索引数组
 * 键可以是数值和字符串的混合
 * $price = array('单人间'=>298, 'VIP套房'=>368);
 * 
 * 常量数组
 * PHP5.6版本中仅能通过自定义常量数组
 * const arr = array("空调", "冰箱", "洗衣机");
 * 
 * PHP8可以通过define()定义常量
 * define('学员',[
 *  '张笑笑',
 *  '杨洋',
 *  '王一一'
 * ])
 */

    define("R",
     [
        100_000 => 5,
        50_000 => 4,
        10_000 => 3,
        3_000 => 2,
        0 => 1
    ]);
    print(R[3_000]);
?>