<?php
    # 算术运算符
    # `+` `-` `*` `/` `%` `++` `--`

    # 字符串运算符
    # `.`

    # 赋值运算符
    # `=` `+=` `-=` `*=` `/=` `.=` `%=` 字符串运算符拼接后赋值给左侧

    # 比较运算符
    # `==` `!=` `>` `<` `>=` `<=` `===`(值相同，类型也相同)
    echo 1=="1";
    echo 1==="1";

    # 逻辑运算符
    # `&&` `||` `and` `or` `!`  `not` `xor`
    echo 1 and 0;

    # 按位运算符
    # `&` `|` `^`(异或) `~`(按位取反) `<<` `>>`

    # 三目运算符
    # (exp1) ? (exp2) : (exp3)

    # 合并运算符
    # (exp1) ?? (exp2)
    # exp1为真，返回exp1的值；exp1为假，返回exp2的值

    # 组合运算符
    # (exp1) <=> (exp2)
    # 比较两个表达式，$a 大于、等于或小于$b，分别返回 -1 0 1



?>